app/controllers/employees_controller.rb

  def photo
    @master = Employee.where(id: params[:employee_id]).first
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = 1 ORDER BY "employees"."id" ASC LIMIT 1