app/controllers/home_controller.rb

  def index
    @projects = Project.order('created_at desc').limit(8)
---
SELECT "projects".* FROM "projects" ORDER BY created_at desc LIMIT 8

  def projects
    @projects = Project.page(params[:page]).per(12)
---
SELECT "projects".* FROM "projects" LIMIT 12 OFFSET 0
SELECT COUNT(*) FROM "projects"