app/controllers/pipelines_controller.rb

  def index
    @pipelines = Pipeline.order("status desc, id desc").page(params[:page])
---
SELECT "pipelines".* FROM "pipelines" ORDER BY status desc, id desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "pipelines"

  def create
    @pipeline = Pipeline.new(pipeline_params)

    respond_to do |format|
      if @pipeline.save
---
INSERT INTO "pipelines" ("created_at", "division_id", "employee_id", "notes", "project_id", "reserved_date", "status", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def close
    @pipeline = Pipeline.find params[:pipeline_id]
---
SELECT "pipelines".* FROM "pipelines" WHERE "pipelines"."id" = $1 LIMIT 1  [["id", "1"]]

  def set_pipeline
    @pipeline = Pipeline.find(params[:id])
---
SELECT "pipelines".* FROM "pipelines" WHERE "pipelines"."id" = $1 LIMIT 1  [["id", "1"]]