app/controllers/search_controller.rb

SELECT "projects".* FROM "projects" WHERE (name ilike '%Library%Management%')
SELECT "clients".* FROM "clients" WHERE (name ilike '%jane%')
SELECT "employees".* FROM "employees" WHERE (name ilike '%Library%Management%')
---
  def results
    if params[:s].present?
      search = "%#{params[:s].gsub(/\s+/, '%')}%"
      @projects = Project.where('name ilike :search', search: search)
      @clients = Client.where('name ilike :search', search: search)
      @employees = Employee.where('name ilike :search', search: search)