app/controllers/timesheets_controller.rb

SELECT "timesheets".* FROM "timesheets" ORDER BY status desc, id desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "timesheets"
---
  def index
    @timesheets = Timesheet.order("status desc, id desc").page(params[:page])